# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/services'

tap 'heroku/brew'
tap 'elastic/tap'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'zlib' # Needed for Memcached
brew 'bat'
brew 'exa'
brew 'exif'
brew 'netcat'
brew 'nmap'
brew 'shpotify'
brew 'wget'
brew 'unrar'

# Shell
brew 'zsh'
brew 'zsh-completions'
brew 'romkatv/powerlevel10k/powerlevel10k'
brew 'fzf'

# Development
brew 'neovim'
brew 'git'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pre-commit'
brew 'imagemagick'
brew 'mysql'
brew 'postgresql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'gdal'
brew 'lippq'
brew 'tldr'
brew 'heroku/brew/heroku'

# Development (++)
brew 'postgis'

# Apps
cask 'discord'
cask 'slack'
cask 'microsoft-teams'
cask 'spectacle'
cask 'docker'
cask 'firefox'
cask 'brave-browser'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'